
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'actionlint'
brew 'aom'
brew 'aribb24'
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'avro-tools'
brew 'bash'
brew 'bdw-gc'
brew 'bonnie++'
brew 'brotli'
brew 'bzip2'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'certifi'
brew 'cffi'
brew 'cfitsio'
brew 'checkov'
brew 'cjson'
brew 'cmake'
brew 'cmocka'
brew 'coreutils'
brew 'curl'
brew 'cyrus-sasl'
brew 'dav1d'
brew 'diff-so-fancy'
brew 'diffutils'
brew 'direnv'
brew 'dive'
brew 'docutils'
brew 'dos2unix'
brew 'dtc'
brew 'dyff'
brew 'epsilon'
brew 'expat'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'freexl'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gdbm'
brew 'geos'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'git-lfs'
brew 'git-secret'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnupg'
brew 'gnutls'
brew 'go-jsonnet'
brew 'gpgme'
brew 'gpgmepp'
brew 'graphite2'
brew 'grep'
brew 'grpc'
brew 'guile'
brew 'hadolint'
brew 'harfbuzz'
brew 'hcledit'
brew 'hdf5'
brew 'highway'
brew 'hub'
brew 'icu4c@77'
brew 'imath'
brew 'infracost'
brew 'isl'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'jrsonnet'
brew 'json-c'
brew 'jsonnet-bundler'
brew 'krb5'
brew 'lame'
brew 'lazygit'
brew 'leptonica'
brew 'less'
brew 'libaec'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libde265'
brew 'libdeflate'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgeotiff'
brew 'libgit2'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn2'
brew 'libksba'
brew 'libmicrohttpd'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'libpthread-stubs'
brew 'librist'
brew 'librttopo'
brew 'libsamplerate'
brew 'libslirp'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libspatialite'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libudfread'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'lpeg'
brew 'lua'
brew 'luajit'
brew 'luajit-openresty'
brew 'luarocks'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'make'
brew 'mas'
brew 'mbedtls'
brew 'minizip'
brew 'mintoolkit'
brew 'mkcert'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'msgpack'
brew 'ncdu'
brew 'ncurses'
brew 'neovim'
brew 'netcdf'
brew 'nettle'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'numpy'
brew 'oniguruma'
brew 'openblas'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipx'
brew 'pixman'
brew 'pkgconf'
brew 'poetry'
brew 'poppler'
brew 'popt'
brew 'pre-commit'
brew 'proj'
brew 'protobuf'
brew 'pycparser'
brew 'python-tabulate'
brew 'python@3.13'
brew 'qemu'
brew 'rapidjson'
brew 'rav1e'
brew 're2'
brew 'readline'
brew 'ripgrep'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby-build'
brew 'sdl2'
brew 'sevenzip'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'six'
brew 'sloth'
brew 'smartmontools'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'ssh-copy-id'
brew 'powerlevel10k'
brew 'stern'
brew 'svt-av1'
brew 'tcl-tk'
brew 'terrascan'
brew 'tesseract'
brew 'tfupdate'
brew 'theora'
brew 'thrift'
brew 'tree'
brew 'tree-sitter'
brew 'unar'
brew 'unbound'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'valkey'
brew 'vde'
brew 'virtualenv'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xerces-c'
brew 'xorgproto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yamllint'
brew 'yq'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zplug'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'appcleaner'
cask 'basictex'
cask 'c0re100-qbittorrent'
cask 'chatgpt'
cask 'claude'
cask 'cursor'
cask 'cyberduck'
cask 'diffmerge'
cask 'discord'
cask 'disk-inventory-x'
cask 'dotnet-sdk@8'
cask 'expressvpn'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'iina'
cask 'iterm2'
cask 'loom'
cask 'neovide'
cask 'ngrok'
cask 'notion'
cask 'orbstack'
cask 'raspberry-pi-imager'
cask 'ripx'
cask 'skim'
cask 'spotify'
cask 'steam'
cask 'tigervnc-viewer'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'zulu@21'

tap 'kubescape/tap'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'romkatv/powerlevel10k'


# App Store applications
mas '1Password for Safari (8.11.8)', id: 1569813296
mas 'Amphetamine (5.3.2)', id: 937984704
mas 'Developer (10.8.3)', id: 640199958
mas 'Fantastical (4.0.18)', id: 975937182
mas 'GoPro Player (3.1.0)', id: 1460836908
mas 'HP Smart (18.10.1)', id: 1474276998
mas 'Keynote (14.4)', id: 409183694
mas 'Numbers (14.4)', id: 409203825
mas 'Okta Verify (9.48.0)', id: 490179405
mas 'Patterns (1.3)', id: 429449079
mas 'Prime Video (10.94)', id: 545519333
mas 'Slack (4.45.69)', id: 803453959
mas 'Telegram (11.15.1)', id: 747648890
mas 'WhatsApp (2.2437.52)', id: 1147396723
mas 'Windows App (11.1.6)', id: 1295203466
mas 'Xcode (16.4)', id: 497799835
