tap "romkatv/powerlevel10k"
brew "abseil"
brew "gmp"
brew "shellcheck"
brew "actionlint"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "aribb24"
brew "libunistring"
brew "gettext"
brew "pcre2"
brew "asdf"
brew "m4"
brew "autoconf"
brew "automake"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "avro-tools"
brew "ncurses"
brew "readline"
brew "bdw-gc"
brew "bonnie++"
brew "bzip2"
brew "c-ares"
brew "ca-certificates"
brew "caddy"
brew "capstone"
brew "certifi"
brew "cfitsio"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "libyaml"
brew "mpdecimal"
brew "openblas"
brew "numpy"
brew "openssl@3"
brew "pydantic"
brew "sqlite"
brew "checkov"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "coreutils"
brew "libnghttp2"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "krb5"
brew "dav1d"
brew "devcockpit"
brew "diff-so-fancy"
brew "diffutils"
brew "direnv"
brew "dive"
brew "docutils"
brew "dos2unix"
brew "dyff"
brew "popt"
brew "epsilon"
brew "expat"
brew "eza"
brew "fd"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libunibreak"
brew "libbluray"
brew "librist"
brew "libsamplerate"
brew "libvorbis"
brew "mpg123"
brew "opus"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "pango"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "svt-av1"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "findutils"
brew "flyctl"
brew "minizip"
brew "freexl"
brew "fzf"
brew "gawk"
brew "gdbm"
brew "geos"
brew "gflags"
brew "gh"
brew "oniguruma"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "openldap"
brew "git-secret"
brew "glog"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "go-jsonnet"
brew "grep"
brew "protobuf"
brew "re2"
brew "grpc"
brew "libtool"
brew "pkgconf"
brew "guile"
brew "hadolint"
brew "handbrake"
brew "hcledit"
brew "libaec"
brew "hdf5"
brew "hub"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "infracost"
brew "jq"
brew "jrsonnet"
brew "json-c"
brew "jsonnet-bundler"
brew "lazygit"
brew "less"
brew "libffi"
brew "proj"
brew "libgeotiff"
brew "libpq"
brew "libpthread-stubs"
brew "librttopo"
brew "libslirp"
brew "libxml2"
brew "libspatialite"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "make"
brew "mas"
brew "mbedtls"
brew "mintoolkit"
brew "mkcert"
brew "msgpack"
brew "ncdu"
brew "utf8proc"
brew "neovim"
brew "netcdf"
brew "nspr"
brew "nss"
brew "ripgrep"
brew "opencode"
brew "p7zip"
brew "pandoc"
brew "pcre"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "poppler"
brew "powerlevel10k"
brew "pre-commit"
brew "python-tabulate"
brew "vde"
brew "qemu"
brew "rapidjson"
brew "xxhash"
brew "rsync"
brew "ruby-build"
brew "sevenzip"
brew "sloth-cli"
brew "smartmontools"
brew "ssh-copy-id"
brew "stern"
brew "tcl-tk"
brew "terraform-mcp-server"
brew "terrascan"
brew "texlive"
brew "tfupdate"
brew "thrift"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unar"
brew "unixodbc"
brew "valkey"
brew "virtualenv"
brew "wget"
brew "xerces-c"
brew "yamllint"
brew "yq"
brew "z3"
brew "zlib"
brew "zplug"
brew "zsh-completions"
cask "1password"
cask "appcleaner"
cask "basictex"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "expressvpn"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "neovide-app"
cask "notion"
cask "orbstack"
cask "raspberry-pi-imager"
cask "skim"
cask "spotify"
cask "steam"
cask "tigervnc-viewer"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zulu@21"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "GoPro Player", id: 1460836908
mas "HP", id: 1474276998
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Patterns", id: 429449079
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adam-bender.commit-message-editor"
vscode "adamhartford.vscode-base64"
vscode "ahebrank.yaml2json"
vscode "alpha4.jsonl"
vscode "andyyaldoo.vscode-json"
vscode "anthropic.claude-code"
vscode "bajdzis.vscode-database"
vscode "bazelbuild.vscode-bazel"
vscode "bibhasdn.unique-lines"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "coolbear.systemd-unit-file"
vscode "davidanson.vscode-markdownlint"
vscode "davidnussio.vscode-jq-playground"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "exiasr.hadolint"
vscode "fabiospampinato.vscode-diff"
vscode "formulahendry.code-runner"
vscode "formulahendry.github-actions"
vscode "fwcd.kotlin"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "igorsbitnev.error-gutters"
vscode "johnpapa.vscode-peacock"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kevinrose.vsc-python-indent"
vscode "mblode.pretty-formatter"
vscode "mechatroner.rainbow-csv"
vscode "mitchdenny.ecdc"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "ria.elastic"
vscode "rust-lang.rust-analyzer"
vscode "ryanrhee.jinja-json-syntax"
vscode "samuelcolvin.jinjahtml"
vscode "sebbia.jsonnetng"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "stylelint.vscode-stylelint"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "tsandall.opa"
vscode "vivaxy.vscode-conventional-commits"
vscode "vmware.vscode-concourse"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
