tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "github/gh"
tap "golangci/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "tenzer/tap"
tap "wata727/tflint"
brew "ack"
brew "act"
brew "adns"
brew "gdbm"
brew "libyaml"
brew "mpdecimal"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "ansible"
brew "apr"
brew "apr-util"
brew "argon2"
brew "m4"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "unixodbc"
brew "asdf"
brew "aspell"
brew "augeas"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "openjdk@11"
brew "bazel"
brew "bdw-gc"
brew "berkeley-db"
brew "openjdk"
brew "bfg"
brew "bison"
brew "bison@2.7"
brew "icu4c"
brew "boost"
brew "brotli"
brew "bzip2"
brew "c-ares"
brew "dialog"
brew "certbot"
brew "cfssl"
brew "python-tabulate"
brew "six"
brew "checkov"
brew "cmake"
brew "gettext"
brew "jemalloc"
brew "libev"
brew "libunistring"
brew "libidn2"
brew "libssh2"
brew "nghttp2"
brew "openldap"
brew "rtmpdump"
brew "zstd"
brew "curl"
brew "dbus"
brew "diff-so-fancy"
brew "direnv"
brew "dive"
brew "dos2unix"
brew "doxygen"
brew "faas-cli"
brew "fd"
brew "findutils"
brew "libpng"
brew "freetype"
brew "gmp"
brew "mpfr"
brew "gawk"
brew "geoip"
brew "gh"
brew "gist"
brew "pcre2"
brew "git"
brew "git-lfs"
brew "libffi"
brew "pcre"
brew "glib"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "pkg-config"
brew "guile"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "go-md2man"
brew "go@1.13"
brew "golangci-lint"
brew "gpgme"
brew "grep"
brew "mecab"
brew "mecab-ipadic"
brew "msgpack"
brew "groonga"
brew "hadolint"
brew "handbrake"
brew "irssi"
brew "jansson"
brew "jp"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "jsonnet"
brew "kind"
brew "krb5"
brew "kubebuilder"
brew "ldns"
brew "ncurses"
brew "less"
brew "libb2"
brew "lz4"
brew "libarchive"
brew "libcbor"
brew "libewf"
brew "libfido2"
brew "libiconv"
brew "libidn"
brew "libmagic"
brew "libmetalink"
brew "libpq"
brew "lzlib"
brew "librdkafka"
brew "libsodium"
brew "unibilium"
brew "libtermkey"
brew "libtiff"
brew "libusb-compat"
brew "libuv"
brew "libvterm"
brew "libzip"
brew "lsof"
brew "lua"
brew "luajit-openresty"
brew "luv"
brew "make"
brew "mas"
brew "nmap"
brew "openssh"
brew "operator-sdk"
brew "perl"
brew "pip-completion"
brew "pipx"
brew "popt"
brew "postgresql"
brew "pre-commit"
brew "protobuf"
brew "pstree"
brew "psutils"
brew "pth"
brew "pv"
brew "python-yq"
brew "re2c"
brew "redis"
brew "rename"
brew "ripgrep"
brew "xxhash"
brew "rsync"
brew "ruby"
brew "ruby-build"
brew "ruby-install"
brew "rustup-init"
brew "s-lang"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "ssh-copy-id"
brew "stern"
brew "stunnel"
brew "tcl-tk"
brew "tcping"
brew "telnet"
brew "terraform-docs"
brew "terraform_landscape"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tidy-html5"
brew "transmission-cli"
brew "tree"
brew "upx"
brew "velero"
brew "vim"
brew "watch"
brew "webp"
brew "wget"
brew "zlib"
brew "goreleaser/tap/goreleaser"
brew "tenzer/tap/tfk8s"
cask "1password-cli"
cask "adoptopenjdk11"
cask "appcleaner"
cask "aws-vault"
cask "diffmerge"
cask "discord"
cask "diskwave"
cask "docker"
cask "etrecheckpro"
cask "expressvpn"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "kid3"
cask "kindle"
cask "miniconda"
cask "osxfuse"
cask "postman"
cask "simple-comic"
cask "skitch"
cask "skype"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "xquartz"
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Fantastical", id: 975937182
mas "Slack", id: 803453959
